app/controllers/rooms_controller.rb

  def show
    if authorized_player?
      current_room
      @players = @room.players.pluck(:name)
---
SELECT "players"."name" FROM "players" WHERE "players"."room_id" = $1  [["room_id", 1]]

  def create
    player = Player.new(player_params)

    if player.save
      room = Room.create
---
INSERT INTO "players" ("name") VALUES ($1) RETURNING "id"  [["name", "Smooth Criminal"]]
INSERT INTO "rooms" ("token") VALUES ($1) RETURNING "id"  [["token", "w6RZDhvLbvvbWfd2q7d6W8ib"]]

  def update
    room = Room.find_by(room_params)
    player = Player.new(player_params)

    if room.present? && player.save
---
INSERT INTO "players" ("name") VALUES ($1) RETURNING "id"  [["name", "I'ma gonna win! Luigi"]]
UPDATE "players" SET "room_id" = $1 WHERE "players"."id" = $2  [["room_id", 9], ["id", 14]]